13/data/attachments/14021c9180332c76.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_52b4ebab-c8b2-4135-bde2-7d7e87ce6375</nif:username>
            <nif:friendToBeAdded>Michael_talk_Friend_6115_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>